УправлениеИТФирмой_First/src/Documents/РеализацияТоваровИУслуг/РеализацияТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровИУслуг</name>
  <basedOn>Document.ЗаказыПокупателей</basedOn>
  <posting>Deny</posting>
  <registerRecords>AccumulationRegister.Товары</registerRecords>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УправлениеИТФирмой_First/src/Documents/РеализацияТоваровИУслуг/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	РедактируемаяСтрока = Элементы.Товары.ТекущиеДанные;
	РасчитатьСумму(РедактируемаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	РедактируемаяСтрока = Элементы.Товары.ТекущиеДанные;
	РасчитатьСумму(РедактируемаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьСумму(СтрокаДляРасчета)
	
	СтрокаДляРасчета.Сумма = СтрокаДляРасчета.Цена*СтрокаДляРасчета.Количество;
	
КонецПроцедуры

&НаКлиенте
Процедура СортировкаСтрокПоСумме(Команда)
	
	Объект.Товары.Сортировать("Сумма Возраст");
	Элементы.ТоварыСортировкаСтрокПоСумме.Пометка = Не Элементы.ТоварыСортировкаСтрокПоСумме.Пометка;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЦены(Команда)
	
	ОбновитьЦеныНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЦеныНаСервере()
	
	  Массив = Новый Массив
	
КонецПроцедуры
